---
type: moc
created: 2025-01-08 01:43
tags:
  - moc
  - cisco
  - nat
  - configuration
---

# üó∫Ô∏è MOC - Configuration NAT Cisco

> [!note] Guide de r√©f√©rence
> Configuration compl√®te du NAT et PAT sur routeurs Cisco IOS.

## üìö Concept

Voir [[NAT - Network Address Translation]] pour le concept g√©n√©ral.

---

## √âtapes de configuration

1. D√©finir les interfaces Inside (r√©seau priv√©) et Outside (Internet)
2. Configurer le type de NAT (statique, dynamique, PAT)
3. Cr√©er les r√®gles de translation

## D√©finition des interfaces

```cisco
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip nat outside      # Interface WAN (Internet)
Router(config-if)# exit

Router(config)# interface GigabitEthernet0/1
Router(config-if)# ip nat inside       # Interface LAN (r√©seau priv√©)
Router(config-if)# exit
```

>[!tip]
>Toute interface connect√©e au r√©seau priv√© = `ip nat inside`
>Interface vers Internet = `ip nat outside`

---

## NAT Statique (1:1)

**Cas d'usage** : Serveur web interne accessible avec IP publique d√©di√©e.

```cisco
# Serveur 192.168.1.10 ‚Üí IP publique 203.0.113.10
Router(config)# ip nat inside source static 192.168.1.10 203.0.113.10
```

**R√©sultat** : Translation bidirectionnelle permanente.

---

## NAT Dynamique (Pool)

**Cas d'usage** : Plusieurs utilisateurs avec pool d'IP publiques.

```cisco
# ACL pour d√©finir les IP √† traduire
Router(config)# access-list 1 permit 192.168.1.0 0.0.0.255

# Pool d'adresses publiques
Router(config)# ip nat pool PUBLIC_POOL 203.0.113.10 203.0.113.20 netmask 255.255.255.0

# Lier l'ACL au pool
Router(config)# ip nat inside source list 1 pool PUBLIC_POOL
```

**Limitation** : 11 connexions max (taille du pool).

---

## PAT / NAT Overload (N:1)

**Cas d'usage** : Partager 1 IP publique pour tout le r√©seau.

```cisco
# ACL pour le r√©seau
Router(config)# access-list 1 permit 192.168.1.0 0.0.0.255

# PAT avec l'IP de l'interface outside
Router(config)# ip nat inside source list 1 interface GigabitEthernet0/0 overload
```

>[!important]
>Le mot-cl√© **overload** active le PAT.

---

## Port Forwarding

**Cas d'usage** : Rediriger port externe vers serveur interne.

```cisco
# Port 80 ‚Üí Serveur web
Router(config)# ip nat inside source static tcp 192.168.1.10 80 203.0.113.1 80

# Port 443 ‚Üí HTTPS
Router(config)# ip nat inside source static tcp 192.168.1.10 443 203.0.113.1 443

# Port externe 2222 ‚Üí SSH interne 22
Router(config)# ip nat inside source static tcp 192.168.1.20 22 203.0.113.1 2222
```

---

## V√©rification

```cisco
# Translations actives
Router# show ip nat translations

# Statistiques
Router# show ip nat statistics

# Configuration NAT
Router# show running-config | include nat

# Compter translations
Router# show ip nat translations | count
```

---

## D√©pannage

```cisco
# Debug (ATTENTION en production!)
Router# debug ip nat
Router# debug ip nat detailed

# Supprimer translations dynamiques
Router# clear ip nat translation *

# Supprimer translation sp√©cifique
Router# clear ip nat translation inside 192.168.1.10
```

---

## Timeouts

```cisco
# Timeout g√©n√©ral (300s = 5 min)
Router(config)# ip nat translation timeout 300

# Timeout TCP (86400s = 24h)
Router(config)# ip nat translation tcp-timeout 86400

# Timeout UDP
Router(config)# ip nat translation udp-timeout 300
```

---

## Exemple Complet : Entreprise avec DMZ

```cisco
# Interface WAN
Router(config)# interface GigabitEthernet0/0
Router(config-if)# ip address 203.0.113.1 255.255.255.248
Router(config-if)# ip nat outside
Router(config-if)# exit

# Interface LAN
Router(config)# interface GigabitEthernet0/1
Router(config-if)# ip address 192.168.1.254 255.255.255.0
Router(config-if)# ip nat inside
Router(config-if)# exit

# Interface DMZ
Router(config)# interface GigabitEthernet0/2
Router(config-if)# ip address 10.0.0.254 255.255.255.0
Router(config-if)# ip nat inside
Router(config-if)# exit

# ACL pour LAN (PAT)
Router(config)# access-list 10 permit 192.168.1.0 0.0.0.255

# PAT pour le LAN
Router(config)# ip nat inside source list 10 interface GigabitEthernet0/0 overload

# NAT statique serveur web DMZ
Router(config)# ip nat inside source static 10.0.0.10 203.0.113.2

# NAT statique serveur mail DMZ
Router(config)# ip nat inside source static 10.0.0.20 203.0.113.3

Router(config)# end
Router# write memory
```

---

## Probl√®mes Courants

| Probl√®me | Solution |
|----------|----------|
| Pas de translation | V√©rifier `ip nat inside/outside` sur interfaces |
| Table NAT pleine | `clear ip nat translation *` |
| NAT statique inactif | V√©rifier routage et ACL |
| Connexions lentes | Augmenter timeout |

---

## Connexions

### Concepts
- [[NAT - Network Address Translation]]
- [[PAT - Port Address Translation]]
- [[Port forwarding]]

### Configuration Linux √©quivalente
- [[MOC - Configuration NAT Linux]]

### Voir aussi
- Canvas : ![[Ex NAT.canvas]]

---

**Sources** : Fiche technique NAT et PAT, [[Formation R√©seau - Jour 2]]
